In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [12]:
df1=DataFrame({'k1':['X','X','X','Y','Y','Z'],
              'k2':['akpan','udo','akpan','udo','udo','akpan'],
             'dataset1':np.random.randn(6),
              'dataset2':np.random.randn(6)}
             )
df1

  k1     k2  dataset1  dataset2
0  X  akpan  1.969303 -1.597775
1  X    udo  0.500199 -1.031882
2  X  akpan -0.492931  0.401231
3  Y    udo -0.976438  0.990983
4  Y    udo  0.698401  0.471520
5  Z  akpan -0.536214 -0.744496

In [24]:
df1.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.658857 -0.742809
Y  -0.139018  0.731251
Z  -0.536214 -0.744496

In [28]:
df1['dataset1'].groupby(df1['k1']).mean()

k1
X    0.658857
Y   -0.139018
Z   -0.536214
Name: dataset1, dtype: float64

In [29]:
cities = np.array(['Uyo','Aba','Aba','Uyo','Uyo','Aba'])
cities

array(['Uyo', 'Aba', 'Aba', 'Uyo', 'Uyo', 'Aba'], dtype='<U3')

In [31]:
month=np.array(['Jan','Jan','Feb','Jan','Feb','Feb'])

In [39]:
df1.groupby([cities,month]).max()

        k1     k2  dataset1  dataset2
Aba Feb  Z  akpan -0.492931  0.401231
    Jan  X    udo  0.500199 -1.031882
Uyo Feb  Y    udo  0.698401  0.471520
    Jan  Y    udo  1.969303  0.990983

In [40]:
df1.groupby([cities,month]).min()

        k1     k2  dataset1  dataset2
Aba Feb  X  akpan -0.536214 -0.744496
    Jan  X    udo  0.500199 -1.031882
Uyo Feb  Y    udo  0.698401  0.471520
    Jan  X  akpan -0.976438 -1.597775

In [57]:
for name,group in df1.groupby('k1'):
    print(f'The name is {name}')
    #print(f'and the group is {group}')
    print(group)
    print('\n')

The name is X
  k1     k2  dataset1  dataset2
0  X  akpan  1.969303 -1.597775
1  X    udo  0.500199 -1.031882
2  X  akpan -0.492931  0.401231


The name is Y
  k1   k2  dataset1  dataset2
3  Y  udo -0.976438  0.990983
4  Y  udo  0.698401  0.471520


The name is Z
  k1     k2  dataset1  dataset2
5  Z  akpan -0.536214 -0.744496

In [46]:
df1.groupby([cities,month]).size()

Aba  Feb    2
     Jan    1
Uyo  Feb    1
     Jan    2
dtype: int64

In [47]:
df1.groupby([cities,month]).count()

         k1  k2  dataset1  dataset2
Aba Feb   2   2         2         2
    Jan   1   1         1         1
Uyo Feb   1   1         1         1
    Jan   2   2         2         2

In [61]:
for (k1,k2), group in df1.groupby(['k1','k2']):
    print(f'k1={k1} and k2={k2}')
    print(group)
    print('\n')

k1=X and k2=akpan
  k1     k2  dataset1  dataset2
0  X  akpan  1.969303 -1.597775
2  X  akpan -0.492931  0.401231


k1=X and k2=udo
  k1   k2  dataset1  dataset2
1  X  udo  0.500199 -1.031882


k1=Y and k2=udo
  k1   k2  dataset1  dataset2
3  Y  udo -0.976438  0.990983
4  Y  udo  0.698401  0.471520


k1=Z and k2=akpan
  k1     k2  dataset1  dataset2
5  Z  akpan -0.536214 -0.744496

In [62]:
gd=dict(list(df1.groupby('k1')))

In [66]:
gd['X']

  k1     k2  dataset1  dataset2
0  X  akpan  1.969303 -1.597775
1  X    udo  0.500199 -1.031882
2  X  akpan -0.492931  0.401231

In [67]:
gd['Y']

  k1   k2  dataset1  dataset2
3  Y  udo -0.976438  0.990983
4  Y  udo  0.698401  0.471520

In [68]:
df1

  k1     k2  dataset1  dataset2
0  X  akpan  1.969303 -1.597775
1  X    udo  0.500199 -1.031882
2  X  akpan -0.492931  0.401231
3  Y    udo -0.976438  0.990983
4  Y    udo  0.698401  0.471520
5  Z  akpan -0.536214 -0.744496

In [70]:
gd1=dict(list(df1.groupby(df1.dtypes,axis=1)))
gd1

{dtype('float64'):    dataset1  dataset2
 0  1.969303 -1.597775
 1  0.500199 -1.031882
 2 -0.492931  0.401231
 3 -0.976438  0.990983
 4  0.698401  0.471520
 5 -0.536214 -0.744496, dtype('O'):   k1     k2
 0  X  akpan
 1  X    udo
 2  X  akpan
 3  Y    udo
 4  Y    udo
 5  Z  akpan}

In [76]:
df1.groupby(['k1','k2']).mean()['dataset1']

k1  k2
X   akpan    0.738186
    udo      0.500199
Y   udo     -0.139018
Z   akpan   -0.536214
Name: dataset1, dtype: float64

In [84]:
df1['dataset1'].groupby(df1['k1']).mean()

k1
X    0.658857
Y   -0.139018
Z   -0.536214
Name: dataset1, dtype: float64

In [85]:
df1.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  akpan  0.738186 -0.598272
   udo    0.500199 -1.031882
Y  udo   -0.139018  0.731251
Z  akpan -0.536214 -0.744496